/* No comment provided by engineer. */
"Authenticating as {0}" = "Dilysu fel {0}";


"Deleting {0}" = "Dileu {0}";
"Disconnected" = "Dadgysylltwyd";
"Disconnecting {0}" = "Dadgysylltu {0}";
"Downloading {0}" = "Lawrlwytho {0}";
/* Connection type opened */
"{0} connection opened" = "Agorwyd cysylltiad {0}";
"Getting size of {0}" = "Canfod maint {0}";
"Getting timestamp of {0}" = "Canfod cofnod amser {0}";

/* Reading permission of file. */
"Getting permission of {0}" = "Getting permission of {0}";

/* No activity */
"Idle" = "Segur";
"Listing directory {0}" = "Rhestru ffolder";
"Making directory {0}" = "Creu ffolder {0}";
"Maximum allowed connections exceeded. Waiting" = "Mae gormod o gysylltiadau. Yn aros…";
"Mounting {0}" = "Mowntio {0}";

/* The user did not accept the certificate or is not valid */
"No trusted certificate found" = "Methwyd dod o hyd i dystysgrif ymddiriedadwy";
"Opening {0} connection to {1}" = "Agor cysylltiad {0} i {1}";
"SFTP subsystem ready" = "Is-system SFTP yn barod";
"SCP subsystem ready" = "SCP subsystem ready";
"Starting SFTP subsystem" = "Cychwyn is-system SFTP";
"Starting SCP subsystem" = "Starting SCP subsystem";
"Uploading {0}" = "Fynylwytho {0}";

/* Renaming file status message; Renaming to <new filename>. */
"Renaming {0} to {1}" = "Renaming {0} to {1}";

/* Duplicate a file */
"Copying {0} to {1}" = "Copying {0} to {1}";

/* Changing the owner of a file */
"Changing owner of {0} to {1}" = "Changing owner of {0} to {1}";

/* Changing the group owner of a file */
"Changing group of {0} to {1}" = "Changing group of {0} to {1}";

/* Changing UNIX file permissions */
"Changing permission of {0} to {1}" = "Changing permission of {0} to {1}";

/* Indicates remaining time needed for files to transfer */
"{0} seconds remaining" = "{0} seconds remaining";

/* Indicates remaining time needed for files to transfer */
"{0} minutes remaining" = "{0} minutes remaining";

/* Indicates remaining time needed for files to transfer */
"{0} hours remaining" = "{0} hours remaining";

/* When trying to determine the IP address of a server hostname; e.g. Resolving example.net */
"Resolving {0}" = "Resolving {0}";

/* Retry in 10 seconds - Used to indicate the time left until another connection attempt is made */
"Retry again in {0} seconds ({1} more attempts)" = "Retry again in {0} seconds ({1} more attempts)";
"Transfer complete" = "Transfer complete";
"Transfer incomplete" = "Transfer incomplete";

/* Content distribution network (CDN) */
"Enable {0} Distribution" = "Enable {0} Distribution";
"Disable {0} Distribution" = "Disable {0} Distribution";

/* Compress and expand archives */
"Archiving {0}" = "Archiving {0}";
"Unarchiving {0}" = "Unarchiving {0}";

/* Compute MD5 hash */
"Compute MD5 hash of {0}" = "Compute MD5 hash of {0}";

/* Reading HTTP headers */
"Reading metadata of {0}" = "Reading metadata of {0}";

/* Writing custom HTTP headers */
"Writing metadata of {0}" = "Writing metadata of {0}";

/* Prepare path for transfer */ 
"Prepare {0}" = "Prepare {0}";

/* Content distribution network (CDN) configuration */
"Reading CDN configuration of {0}" = "Reading CDN configuration of {0}";
"Writing CDN configuration of {0}" = "Writing CDN configuration of {0}";﻿

/* Growl Notification */
"Connection failed" = "Methodd y cysylltiad";

/* Growl Notification */
"Connection opened" = "Agorwyd cysylltiad";

/* Growl Notification */
"Download complete" = "Cwblhauwyd lawrlwytho";

/* Growl Notification */
"Synchronization complete" = "Cwblhauwyd cyd-drefnu";

/* Growl Notification */
"Upload complete" = "Cwblhauwyd fynylwytho";

/* Growl Notification */
"Download failed" = "Download failed";

/* Growl Notification */
"Upload failed" = "Upload failed";

/* Growl Notification */
"Transfer queued" = "Transfer queued";
